from math import ceil
from sys import argv
print('\033[1;33m免责声明：数据仅供参考，开发者不对使用此软件造成的任何损失负责\033[0m')
可用金额=int(input('你要换多少钱？')) if len(argv)==1 else int(argv[1])
def 打印(应输金额,实际用钱,亏损,尾款):
  print('- 应输入金额：%s'%应输金额)
  print('- 实际用钱：%.2f（亏损%.2f）'%(实际用钱,亏损))
  print('- 尾款：%.2f'%尾款)
if 可用金额<30:
  #x*(1-0.05)=30+y
  应输金额=ceil((20*可用金额+600)/19)
  打印(应输金额,应输金额*0.05+30*0.05+可用金额,应输金额*0.05+30*0.05,应输金额*(1-0.05)-30-可用金额)
else:
  #x*(1-0.05)=y
  应输金额=ceil((20*可用金额)/19)
  打印(应输金额,应输金额*0.05+可用金额,应输金额*0.05,应输金额*(1-0.05)-可用金额)